## Lab04 - pandas
Name: Anh Kieu  
Class: CSCI 349 - Intro to Data Mining  
Semester: Spring 2021  
Instructor: Brian King

In [1]:
import sys
import numpy as np
import pandas as pd

In [2]:
days = ["Mon","Tue","Wed","Thurs","Fri","Student"]
scores = pd.DataFrame([pd.Series([9.5, 8.75, 8, 10, 7.75, "Bob"], index=days, name="week_1"),
pd.Series([9, 8, 10, 8.75, 7.25, "Jane"], index=days, name="week_1"),
pd.Series([8.5, 0, 9.75, 9, 6, "Bob"], index=days, name="week_2"),
pd.Series([7, 8.25, 9.25, 0, 8, "Jane"], index=days, name="week_2"),
pd.Series([7, 8.5, 9.25, 0, 0, "Bob"], index=days, name="week_3"),
pd.Series([8.5, 8.25, 9, 8, 7.5, "Jane"], index=days, name="week_3"),
pd.Series([9, 7, 8.5, 8, 8, "Bob"], index=days, name="week_4"),
pd.Series([9.25, 9.25, 8.5, 7.75, 7.5, "Jane"], index=days,
name="week_4")])
scores

         Mon   Tue    Wed  Thurs   Fri Student
week_1  9.50  8.75   8.00  10.00  7.75     Bob
week_1  9.00  8.00  10.00   8.75  7.25    Jane
week_2  8.50  0.00   9.75   9.00  6.00     Bob
week_2  7.00  8.25   9.25   0.00  8.00    Jane
week_3  7.00  8.50   9.25   0.00  0.00     Bob
week_3  8.50  8.25   9.00   8.00  7.50    Jane
week_4  9.00  7.00   8.50   8.00  8.00     Bob
week_4  9.25  9.25   8.50   7.75  7.50    Jane

#### 1) [P] Report the shape, the number of dimensions, the size of the data, and the data types of each column. Print each separately. Then create an additional code cell that shows the results of scores.info().

In [3]:
print("Shape:", scores.shape)
print("Number of dims:", scores.ndim)
print("Size of data:", scores.memory_usage())
print("Data types:\n", scores.dtypes)

Shape: (8, 6)
Number of dims: 2
Size of data: Index      64
Mon        64
Tue        64
Wed        64
Thurs      64
Fri        64
Student    64
dtype: int64
Data types:
 Mon        float64
Tue        float64
Wed        float64
Thurs      float64
Fri        float64
Student     object
dtype: object

In [4]:
scores.info()

<class 'pandas.core.frame.DataFrame'>
Index: 8 entries, week_1 to week_4
Data columns (total 6 columns):
 #   Column   Non-Null Count  Dtype
---  ------   --------------  -----
 0   Mon      8 non-null      float64
 1   Tue      8 non-null      float64
 2   Wed      8 non-null      float64
 3   Thurs    8 non-null      float64
 4   Fri      8 non-null      float64
 5   Student  8 non-null      object
dtypes: float64(5), object(1)
memory usage: 448.0+ bytes

#### 2) [P] Show two different ways to report the number of observations in scores.

In [5]:
print("Method 1:", scores.size)
print("Method 2:", scores.shape[0] * scores.shape[1])

Method 1: 48
Method 2: 48

#### 3) [P] Show the variables (i.e. columns) in scores

In [6]:
scores.columns

Index(['Mon', 'Tue', 'Wed', 'Thurs', 'Fri', 'Student'], dtype='object')

#### 4) [P] There are repetitive names in the index. This happens quite a bit, depending on how the rows are to be named. For now. print the unique index names in scores

In [7]:
unique_index = set(scores.index)
print('Unique index:', ' '.join(unique_index))

Unique index: week_4 week_2 week_3 week_1

#### 5) [P] Rename the 'Thurs' column header to be 'Thu' .

In [8]:
scores.rename(columns = {"Thurs" : "Thu"})

         Mon   Tue    Wed    Thu   Fri Student
week_1  9.50  8.75   8.00  10.00  7.75     Bob
week_1  9.00  8.00  10.00   8.75  7.25    Jane
week_2  8.50  0.00   9.75   9.00  6.00     Bob
week_2  7.00  8.25   9.25   0.00  8.00    Jane
week_3  7.00  8.50   9.25   0.00  0.00     Bob
week_3  8.50  8.25   9.00   8.00  7.50    Jane
week_4  9.00  7.00   8.50   8.00  8.00     Bob
week_4  9.25  9.25   8.50   7.75  7.50    Jane

#### 6) [P] Now, make a bigger change. Let's rename 'week_1' to be 'w1', 'week_2' to be 'w2', and so on. Also, suppose you decide to use only 2 letter abbreviations for the days. Rename the days in the column names to be 'Mo', 'Tu', 'We', 'Th', 'Fr'.

In [9]:
rename_col = lambda x: x[0:2]
rename_ind = lambda x: x[0] + x[-1]
scores = scores.rename(rename_ind, axis = 'index')
scores = scores.rename(rename_col, axis = 'columns')
scores = scores.rename(columns = {'St': 'Student'})
scores

      Mo    Tu     We     Th    Fr Student
w1  9.50  8.75   8.00  10.00  7.75     Bob
w1  9.00  8.00  10.00   8.75  7.25    Jane
w2  8.50  0.00   9.75   9.00  6.00     Bob
w2  7.00  8.25   9.25   0.00  8.00    Jane
w3  7.00  8.50   9.25   0.00  0.00     Bob
w3  8.50  8.25   9.00   8.00  7.50    Jane
w4  9.00  7.00   8.50   8.00  8.00     Bob
w4  9.25  9.25   8.50   7.75  7.50    Jane

#### 7) [PM] Compare the type of the expression scores['Mo'] vs. scores[['Mo']]. What is the difference?

In [10]:
print(type(scores['Mo']))
print(type(scores[['Mo']]))

<class 'pandas.core.series.Series'>
<class 'pandas.core.frame.DataFrame'>

['Mo'] is Series while [['Mo']] refers to DataFrame. ['Mo'] could be thought of as element in index 'Mo', and therefore, is typed Series. On the other hand, [['Mo']] refers to the sub DataFrame and therefore is a DataFrame

#### 8) [P] Demonstrate the describe() method on scores. What type does it return?

In [11]:
scores.describe()
# This returns a dataframe with statistical summary

             Mo      Tu         We         Th        Fr
count  8.000000  8.0000   8.000000   8.000000  8.000000
mean   8.468750  7.2500   9.031250   6.437500  6.500000
std    0.967669  3.0000   0.673974   4.037215  2.702512
min    7.000000  0.0000   8.000000   0.000000  0.000000
25%    8.125000  7.7500   8.500000   5.812500  6.937500
50%    8.750000  8.2500   9.125000   8.000000  7.500000
75%    9.062500  8.5625   9.375000   8.812500  7.812500
max    9.500000  9.2500  10.000000  10.000000  8.000000

#### 9) [P] Store the output of describe() as a variable. Then, using this data frame, report the day that had the largest standard deviation in quiz scores and its value. Clean your temporary variables when complete (i.e. use del)

In [12]:
summary = scores.describe()
max_day = summary.loc["std"].idxmax()
max_val = summary.loc["std"].max()
print(f"{max_day} had the highest standard deviation: {max_val:.3f}")
del(summary, max_day, max_val)

Th had the highest standard deviation: 4.037

#### 10) [P] Write the Python code to repeat the previous exercise without using describe().

In [13]:
std = scores.std(axis = 0)
print(f"{std.idxmax()} had the highest standard deviation: {std.max():.3f}")

Th had the highest standard deviation: 4.037

#### 11) [P] Write the code that changes all 0.0 entries to np.nan.

In [14]:
scores = scores.replace({0: np.nan})
scores

      Mo    Tu     We     Th    Fr Student
w1  9.50  8.75   8.00  10.00  7.75     Bob
w1  9.00  8.00  10.00   8.75  7.25    Jane
w2  8.50   NaN   9.75   9.00  6.00     Bob
w2  7.00  8.25   9.25    NaN  8.00    Jane
w3  7.00  8.50   9.25    NaN   NaN     Bob
w3  8.50  8.25   9.00   8.00  7.50    Jane
w4  9.00  7.00   8.50   8.00  8.00     Bob
w4  9.25  9.25   8.50   7.75  7.50    Jane

#### 12) [P] Show the output of describe() again.

In [15]:
scores.describe()

             Mo        Tu         We         Th        Fr
count  8.000000  7.000000   8.000000   6.000000  7.000000
mean   8.468750  8.285714   9.031250   8.583333  7.428571
std    0.967669  0.698638   0.673974   0.846562  0.687906
min    7.000000  7.000000   8.000000   7.750000  6.000000
25%    8.125000  8.125000   8.500000   8.000000  7.375000
50%    8.750000  8.250000   9.125000   8.375000  7.500000
75%    9.062500  8.625000   9.375000   8.937500  7.875000
max    9.500000  9.250000  10.000000  10.000000  8.000000

#### 13) [PM] Show the output of scores.values. What does the .values attribute do?

In [16]:
scores.values

array([[9.5, 8.75, 8.0, 10.0, 7.75, 'Bob'],
       [9.0, 8.0, 10.0, 8.75, 7.25, 'Jane'],
       [8.5, nan, 9.75, 9.0, 6.0, 'Bob'],
       [7.0, 8.25, 9.25, nan, 8.0, 'Jane'],
       [7.0, 8.5, 9.25, nan, nan, 'Bob'],
       [8.5, 8.25, 9.0, 8.0, 7.5, 'Jane'],
       [9.0, 7.0, 8.5, 8.0, 8.0, 'Bob'],
       [9.25, 9.25, 8.5, 7.75, 7.5, 'Jane']], dtype=object)

.values attribute returns the numpy 2-D array that corresponds to the dataframe

#### 14) [P] What is the mean quiz score for each day? Do not use describe()

In [17]:
scores.mean()

Mo    8.468750
Tu    8.285714
We    9.031250
Th    8.583333
Fr    7.428571
dtype: float64

#### 15) [P] What is the mean quiz score over the entire dataset, ignoring all missing values?

In [18]:
pure_scores = scores.iloc[:, 0:5]
all_scores = pure_scores.values
np.nanmean(all_scores)

8.375

#### 16) [P] Show the mean for each week over all students.

In [19]:
total = scores.groupby(level = 0).sum().sum(axis = 1)
counts = pure_scores.groupby(level = 0).count().sum(axis=1) # pure_scores = scores.iloc[:, 0:5]
print(f"Mean score for each week over all students:\n{total/counts}")

Mean score for each week over all students:
w1    8.70000
w2    8.21875
w3    8.25000
w4    8.27500
dtype: float64

#### 17) [P] Show the mean score for each student. Again, ignore all missing values.

In [20]:
by_student = scores.groupby(['Student']).sum().sum(axis = 1)
by_student_counts = scores.groupby(['Student']).count().sum(axis = 1)
print(by_student_counts)
print(by_student/by_student_counts)

Student
Bob     17
Jane    19
dtype: int64
Student
Bob     8.382353
Jane    8.368421
dtype: float64

#### 18) [P] Select the data frame for only Monday and Student variables using .loc, and again using .iloc

In [21]:
scores.loc[:, ['Mo', 'Student']]

      Mo Student
w1  9.50     Bob
w1  9.00    Jane
w2  8.50     Bob
w2  7.00    Jane
w3  7.00     Bob
w3  8.50    Jane
w4  9.00     Bob
w4  9.25    Jane

In [22]:
scores.iloc[:, [0, -1]]

      Mo Student
w1  9.50     Bob
w1  9.00    Jane
w2  8.50     Bob
w2  7.00    Jane
w3  7.00     Bob
w3  8.50    Jane
w4  9.00     Bob
w4  9.25    Jane

#### 19) [P] Show a new DataFrame containing the week as an index (like the original), but contains only each student with the count of their quizzes and the mean of their scores.

In [23]:
counts = pure_scores.count(axis = 1) # pure_scores = scores.iloc[:, 0:5]
means = pure_scores.mean(axis = 1)
count_and_mean = scores.iloc[:, -1]
pd.concat([count_and_mean, counts, means], axis = 1, keys = ["Student", "count", "mean"])

   Student  count    mean
w1     Bob      5  8.8000
w1    Jane      5  8.6000
w2     Bob      4  8.3125
w2    Jane      4  8.1250
w3     Bob      3  8.2500
w3    Jane      5  8.2500
w4     Bob      5  8.1000
w4    Jane      5  8.4500

#### 20) [P] Show the number of times Friday's score was greater than 7.25 for each student by using value_counts

In [24]:
fridays = scores.iloc[:, [-2, -1]]
fridays.mask(fridays.iloc[:, 0] <= 7.25).value_counts().groupby('Student').sum()

Student
Bob     2
Jane    3
dtype: int64

#### 21) [P] Repeat the previous exercise, but this time use the where() method on scores to select your data.

In [25]:
fridays.where(fridays.iloc[:,0] > 7.25).groupby('Student').count()

         Fr
Student
Bob       2
Jane      3

#### 22) [P] Select the scores that were greater than the mean score over the entire dataset

In [26]:
mean_score = np.nanmean(all_scores) # all_scores is 1-D series of all the scores, defined from question 15
pure_scores.where(pure_scores > mean_score).count()

Mo    6
Tu    3
We    7
Th    3
Fr    0
dtype: int64

#### 23) [P] When dealing with enormous datasets for modeling, we often drop all observations that have any missing data. Show a new data frame that has only complete observations.

In [27]:
scores.dropna()

      Mo    Tu    We     Th    Fr Student
w1  9.50  8.75   8.0  10.00  7.75     Bob
w1  9.00  8.00  10.0   8.75  7.25    Jane
w3  8.50  8.25   9.0   8.00  7.50    Jane
w4  9.00  7.00   8.5   8.00  8.00     Bob
w4  9.25  9.25   8.5   7.75  7.50    Jane